import numpy as np
import os


# -------------------------------------------------------------------------------------------------------------------- #
def visual_fileData(fileName):
    dataAll = []
    with open(fileName, "r", encoding="utf-8") as f:
        for row in f:
            dataAll.append(row)

    file_header = dataAll[headerIndex]

    dataAll_new = []
    for i in range(len(dataAll)):
        if i > headerIndex:
            dataAll_new.append(dataAll[i].split(","))
        else:
            pass

    dataAll_newFloat = np.zeros(shape=np.shape(dataAll_new))

    for i in range(len(dataAll_new)):
        for j in range(len(dataAll_new[0])):
            dataAll_newFloat[i, j] = float(dataAll_new[i][j])

    return file_header, dataAll_newFloat


########################################################################################################################
"""Ma6-60kPa工况最后闭环控制车次传感器编号和坐标"""

# 传感器坐标
S_position = np.asarray([46.39, 96.39, 146.38, 196.37, 246.37, 346.75, 396.68, 446.62, 496.55, 546.49, 596.42, 646.36, 696.29, 746.23, 796.72,  # 隔离段上侧
                         905.86, 935.86, 965.86, 995.86, 1025.85, 1055.85, 1085.84, 1115.83, 1145.83, 1175.82, 1205.82,  # 一级支板/凹腔燃烧室 11个
                         1284.36, 1314.36, 1344.36, 1374.36, 1404.36, 1434.36, 1464.36, 1494.36, 1524.36, 1554.36,  # 二级支板/凹腔燃烧室 10个
                         1653.56, 1723.56, 1793.56, 1863.56, 1933.56, 2003.56, 2073.56, 2143.56, 2213.56, 2283.56, 2353.56, 2423.56,  # 火箭段 12个
                         2542.36, 2602.36, 2662.36, 2722.36, 2782.36, 2842.36])  # 喷管段 6个
S_position = S_position/1000  # 单位 m

# 传感器索引编号
S_index = np.asarray([36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
                      51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61,
                      62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
                      72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83,
                      84, 85, 86, 87, 88, 89])

# 列名称
headerIndex = 10


# 处理存在问题的传感器点  20 21 23
index_bad = [3, 20, 21, 23]

S_index = np.delete([S_index], index_bad, axis=1)[0]
S_position = np.delete([S_position], index_bad, axis=1)[0]



# -------------------------------------------------------------------------------------------------------------------- #
if __name__ == "__main__":

    fileName_test1 = r"./resourceData/20240513-173项目-Ma6-3kg-第五十七车-热试-隔离段.txt"
    fileName_test2 = r"./resourceData/20240513-173项目-Ma6-3kg-第五十七车-热试-流道.txt"
    header, _ = visual_fileData(fileName_test2)
    header = header.split(",")

    print("头文件名称 = ", header)

    name = ["流量", "喷", "49", "室压", "1", "7", "温", "Y"]
    # name = ["Time"]

    for i in range(len(header)):
        for nameS in name:
            if nameS in header[i]:
                print(i, "   --->   ", header[i])








"""
################################################################
文件1 - 隔离段
30    --->    通道 37/HJ02-比例阀1-喷前 -  (MPa)
32    --->    通道 39/HJ04-比例阀2-喷前 -  (MPa)

36    --->    通道 43/HJ08-甲烷火箭室压 -  (MPa)

40    --->    通道 53/HJ18-下1* -  (MPa)
41    --->    通道 54/HJ19-下2* -  (MPa)
42    --->    通道 55/HJ20-下3* -  (MPa)
43    --->    通道 56/HJ21-下4* -  (MPa)
44    --->    通道 57/HJ22-下5* -  (MPa)
45    --->    通道 58/HJ23-下6* -  (MPa)
52    --->    通道 76/1-下7 -  (MPa)
53    --->    通道 77/2-下8 -  (Mpa)
54    --->    通道 78/3-下9 -  (MPa)
55    --->    通道 79/4-下10 -  (MPa)
56    --->    通道 80/5-下11 -  (MPa)
57    --->    通道 81/6-下12 -  (MPa)
58    --->    通道 82/7-下13 -  (MPa)
59    --->    通道 84/9-下14 -  (MPa)
60    --->    通道 85/10-下15 -  (Mpa)
61    --->    通道 86/11-下16 -  (Mpa)


################################################################
文件2 - 主流道
0    --->    Time (s)

36    --->    通道 47/P04-流道4 -  (MPa)
37    --->    通道 48/P05-流道5 -  (MPA)
38    --->    通道 49/P06-流道6 -  (MPa)
39    --->    通道 50/P07-流道7 -  (MPA)
40    --->    通道 51/P08-流道8 -  (MPA)
41    --->    通道 52/P09--流道9 -  (MPA)
42    --->    通道 53/P10--流道10 -  (MPA)
43    --->    通道 54/P11--流道11 -  (MPA)
44    --->    通道 55/p12--流道12 -  (MPA)
45    --->    通道 56/P13-流道13 -  (MPA)
46    --->    通道 57/P14-流道14 -  (MPA)
47    --->    通道 58/P15-流道15 -  (MPA)
48    --->    通道 59/P016-流道16 -  (MPA)
49    --->    通道 60/P017-流道17 -  (MPA)
50    --->    通道 61/P018-流道18 -  (MPA)
51    --->    通道 62/P019-流道19 -  (MPA)
52    --->    通道 63/P020-流道20 -  (MPA)
53    --->    通道 64/P021-流道21 -  (MPa)
54    --->    通道 65/P022-流道22 -  (V)
55    --->    通道 66/P023--流道23 -  (MPa)
56    --->    通道 67/P024-流道24 -  (MPA)
57    --->    通道 68/P025 -流道25 -  (MPa)
58    --->    通道 69/P026-流道26 -  (MPA)
59    --->    通道 70/P027-流道27 -  (MPA)
60    --->    通道 71/P028 -流道28 -  (MPa)
61    --->    通道 72/P029-流道29 -  (MPA)
62    --->    通道 73/P030-流道30 -  (MPA)
63    --->    通道 74/P031-流道31 -  (MPa)
64    --->    通道 75/P032-流道32 -  (MPa)
65    --->    通道 76/P033 -流道33 -  (MPa)
66    --->    通道 77/P034 -流道34 -  (MPA)
67    --->    通道 78/P035-流道35 -  (MPA)
68    --->    通道 79/P036-流道36 -  (MPa)
69    --->    通道 80/P037-流道37 -  (MPa)
70    --->    通道 81/P038-流道38 -  (MPA)
71    --->    通道 82/P039-流道39 -  (MPa)
72    --->    通道 83/P040-流道40 -  (MPa)
73    --->    通道 84/P041-流道41 -  (MPa)
74    --->    通道 85/P042-流道42 -  (MPA)
75    --->    通道 86/P043-流道43 -  (MPA)
76    --->    通道 87/P044-流道44 -  (MPa)
77    --->    通道 88/P045-流道45 -  (MPA)
78    --->    通道 89/P046-流道46 -  (MPa)
79    --->    通道 90/P047-流道47 -  (MPa)
80    --->    通道 91/P048-流道48 -  (MPa)
81    --->    通道 92/P049-流道49 -  (MPa)
82    --->    通道 93/P050-流道50 -  (MPa)
83    --->    通道 94/P051-流道51 -  (MPa)
84    --->    通道 95/P052-流道52 -  (MPA)
85    --->    通道 96/P053-流道53 -  (MPa)
86    --->    通道 97/P054-流道54 -  (MPa)
87    --->    通道 98/P055-流道55 -  (MPa)
88    --->    通道 100/P057-流道56 -  (MPa)
89    --->    通道 101/P058-流道57 -  (MPa)



"""
